{"inkVersion":20,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["^(You feel a faint shadowy aura from the person, do you want to try talking to him?)","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^No","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","end",{"#f":5}],"c-1":["\n","end",{"#f":5}]}],{"#f":1}],"progress1":["^You: Hey there, nice spot you've got there, mind if I sit beside you?","\n","^BOY: I-… uh… …","\n","^The boy seemed to start panicking and is nervous about your presence as he tries to speak","\n","^(You could already feel the shadow energy is growing rapidly)","\n","^Mysterious person: Seems like we have no choice but to help him calm down.","\n","^Mysterious person: I’ll use my powers to calm him down first, but it would be temporary as it doesn’t really solve the root cause.","\n","^Mysterious person: Now face your hands towards him.","\n","^As you lift your hands and aim towards the child, your hand starts to emit a weak but warm light.","\n","^You can feel the shadow energy has subsided.","\n","^You: You feeling better?","\n","^BOY: ...yes ...?! I- I can speak better...","\n","^You: Great!","\n","^BOY: Wh- who are you…? My parents told me not to talk to strangers.","\n","^You: But you are already talking to me.","\n","^BOY: Ah…!","\n","^He then closes his mouth with both hands","\n","^You: Ahahaha, don't worry I won't do any harm to you.","\n","^You: Actually, I am a magician that helps to cheer people up and you seem to be a little down.","\n","^BOY: Wow so that light was actually magic?! Ca- can you show me again?","\n","^Looks like he is more interested with the magic rather than yourself","\n","^You: (Hey, use that magic again. I need to prove myself)","\n","^Mysterious person: My powers aren’t for performance… but fine…","\n","^(You emit light again)","\n","^BOY: Wow… that’s so cool. It’s like magic from the fantasy movies!","\n","^You: Yeah, it is actually a special small magic that helps people to calm down.","\n","^BOY: Ca- can you teach me that magic…?","\n","^You: Why?","\n","^BOY: …Actually I usually would get really nervous in front of people, but somehow your magic was able to help me calm down.","\n","^BOY: This is probably my first time being able to properly talk to other people… so I really want to learn it so I can speak with other people…","\n","^He talks about his reasons as he looks toward the other kids at the playground.","\n","^You: (What do you think?)","\n","^Mysterious person: Well maybe we could prepare some reward and go for exposure-based behavioural therapy.","\n","^You: (What’s that?)","\n","^Mysterious person: We can first decide on an exposure hierarchy, like creating a list of tasks that is related to interacting with others starting small and gradually increase more exposure.","\n","^Mysterious person: Then provide rewards for each task that was completed to keep the motivation going. Slowly increasing his confidence and help him getting used to interacting with others.","\n","^You: (Hmm sounds good, maybe we can try that)","\n","^You: Hmm… to be honest the light magic only has temporary effect, but I can teach you a different “magic” which is more effective.","\n","^BOY: Really? Th- thank you…!","\n","^You: Of course, I already told you that I am a magician that cheers people up right?  Before that I need to prepare some stuff, I’ll be back.","\n","^BOY: Ok…? He’s already gone…","\n","end",{"#f":1}],"progress2":[["^You: (Maybe we can start from deciding on the list of tasks.)","\n","^You: (Hmm maybe he can start from interacting with me without the help of the magic, as for the order of the task…)","\n","ev","str","^Make eye contact with me","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Try to whisper “Hi” to me","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Try to answer close-ended question","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Try to answer open-ended question","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","end",{"#f":5}],"c-1":["\n","end",{"#f":5}],"c-2":["\n","end",{"#f":5}],"c-3":["\n","^You: (Basically, try to make eye contact, try to whisper “hi” to me, try to answer close-ended question and finally try to answer open-ended question.)","\n","^Mysterious person: Seems fine to me.","\n","^You: (Before that, we need to know what he likes for the reward.)","\n","^Mysterious person: It seems like he likes chocolate","\n","^You: (So we need to find chocolate… but how do we get it)","\n","^Mysterious person: Well, you can go to the local store by heading South.","\n","^You: (But I don’t have money on me…)","\n","^Mysterious person: I do have some money but you’ll have to get it by yourself, it is at the tree house which is also located South.","\n","^You: (Why do you even have money, you don’t really need it right?)","\n","^Mysterious person: Well I don’t but that doesn’t mean that I can’t have it. Don’t worry the money is really mine, I guarantee it.","\n","^You: (Fine… so now I have to exit the park by heading south and go to the tree house to get money and go to the store to buy some chocolate.)","\n","end",{"#f":5}]}],{"#f":1}],"progress3":["^You: Hi, I am back","\n","^BOY: Welcome back so the preparations are ready…?","\n","^You: Yeah","\n","^You then explain about the plan","\n","^BOY: That doesn’t really sound like magic to me…","\n","^He doesn’t seem as excited as before when I told him that I will teach him “magic”","\n","^You: You will be rewarded with chocolate for each task completed","\n","^BOY: …How did you know I like chocolate","\n","^You: Well it’s magic. So would you like to try?","\n","^BOY: …I’ll believe you for once.","\n","^You can see that he is drooling knowing that he is attracted by the reward as you showed him the chocolate.","\n","^You: Great! Let’s start. So I will release the magic casted on you, but don’t worry I will help you to calm down if needed.","\n","^You: Also you can take your time and keep trying, even if you fail you won’t lose your reward.","\n","^BOY: O- okay… I am ready.","\n","^You put your hands in front of him and mysterious person removes the magic casted on him.","\n","^You can see him starting to feel slightly nervous in front of you.","\n","^You: Good job! You did great!","\n","^BOY: Th- thank… you…, I feel… a little more… confident.","\n","^You: Maybe you can now try to communicate with others.","\n","^BOY: O- ok… I think… I can try…","\n","^You: I’ll go prepare, wait me for a while.","\n","^BOY: O- ok… he’s gone again…","\n","end",{"#f":1}],"progress4":[["^You: (If that’s the case then maybe we need new tasks…)","\n","ev","str","^Try to whisper to a familiar peer with me","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Try to whisper to a familiar peer alone","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Try to whisper to a new peer with me","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Try to whisper to a new peer alone","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","end",{"#f":5}],"c-1":["\n","end",{"#f":5}],"c-2":["\n","end",{"#f":5}],"c-3":["\n","^You: (Currently there’s still enough reward, but we need to find some help from other people)","\n","^Mysterious person: I can feel that one of the kids at the playground is rather familiar with him, maybe we can ask her to help.","\n","^You: (Which one?)","\n","^Mysterious person: The girl with (to be added).","\n","end",{"#f":5}]}],{"#f":1}],"progress5":["^You: I brought some help","\n","^BOY: …! Umm… h-… …","\n","^He starts to tense up but despite that he tries to talk.","\n","^Girl: Hi (BOY name), I already heard everything from this person, so don’t worry you can take your time.","\n","^BOY: … … … o… k… (small voice)","\n","^You explained about the new task","\n","^You: If you’re ready then let’s start","\n","^BOY: I-… I am… ready…!","\n","^You: Ok I think that should be fine, good work everybody.","\n","^You: Good job, you cleared all the tasks! You have made your first step!","\n","^BOY: Th- thank… you…","\n","^You: How do you feel now?","\n","^BOY: I- I feel… more confident… even though I… still can’t speak well… but I know I am improving…","\n","^You: Good, I believe that if you keep practicing, you definitely can speak normally with others soon.","\n","^You: But you don’t have to force yourself, just try it with your own pace.","\n","^Mysterious person: Hey the shadow enemy has escaped, probably because he lost the source of shadow energy. Time for us to find it before it affects other people.","\n","^You: I think I have to leave already, I suddenly remembered that I have some urgent matter. Good luck on practicing the “magic” that I have taught you.","\n","^BOY: Wa- wait… he is… gone again…","\n","end",{"#f":1}],"progress6":["^Girl: What a strange person, but thanks to him I am now able to talk with you.","\n","^BOY: Ye- yeah… umm…","\n","^Girl: Oh right! I also just remembered about something! Wait for me I’ll go get something from my bag!","\n","^BOY: O-… ok…","\n","^She then went to get her bag that she brought with her and she took some stuff out and hid it behind her as she returns.","\n","^Girl: Ok it’s fine now.","\n","^BOY: …?","\n","^The boy notices about she is hiding something behind her and was curious what it is about.","\n","^Girl: Actually there is a gift for you, but I didn’t really had a chance to give you.","\n","^Girl: So I am glad that I finally can hand you the gift.","\n","^She then showed the stuff hidden behind her and hands him a small whiteboard and a marker.","\n","^Girl: Ta- da- This is a gift from the whole class!","\n","^Girl: We thought that maybe you can use this board to help you communicate whenever you find yourself having problems talking with us or other people.","\n","^Girl: At least in situations that you can’t talk well, you still can write on this to convey your message.","\n","^Girl: Everyone in class knew that you feel nervous about talking with others.","\n","^Girl: Despite not having much chance to know each other through communication, we knew that you were a nice person who helps everyone whenever someone is in trouble.","\n","^Girl: That’s why the whole class tried to think of a way for you to communicate with us, and we thought of this gift.","\n","^BOY: …!","\n","^The boy’s eye starts to become teary, as he accepts the gift.","\n","^Knowing that there are people who understands his problem, who accept him despite not being able to communicate well, it was a relief for him.","\n","^He always worried that he troubled others by being unable to speak well.","\n","^The girl start to panic and tried to comfort him.","\n","^But then he took the marker and start writing on the white board.","\n","^Then he showed her the board.","\n","^“Thank you”","\n","^And he showed a smile while having tears flowing down his face.","\n","^END","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}