{"inkVersion":20,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"progress1":["^Hey there you looked troubled, what seems to be the problem?","\n","^Oh hey umm… actually I lost something and I am trying to find it.","\n","^Do you need help? I am rather free as I am just enjoying a walk around the park.","\n","^Really? That would be a great help! Actually I’ve lost my favourite guitar pick and I just can’t find it anywhere.","\n","^Hmm… when is the last time you saw it?","\n","^…I think it was when I kept it in my wallet after practicing here hours ago. That’s why I came back here trying to find it.","\n","^Then what about the places you’ve went after practicing?","\n","^I think I’ve went to the playground for a walk to get some inspiration for my new song.","\n","^Maybe I can try to go there and search for it.","\n","^Ok thanks man!","\n",{"->":"progress2"},{"#f":1}],"progress2":["^Have you found it yet? I couldn’t find it near the tree.","\n","^No luck here too.","\n","^Oh ok… seriously where did I dropped it…","\n","^(Hey is it possible to locate it with your powers?)","\n","^Well I can sense the linking bond between the item and the owner.","\n","^But I would need him create a strong emotion trail, so that I could use that emotion energy to track it.","\n","^How could he do that?","\n","^Maybe you can try to ask more details about it so that he would think more about it.","\n","^Is it really an important stuff?","\n","^Yeah it’s actually a present from my father, the reason that I like to play guitar is all thanks to him.","\n","^My father was a famous vocal and guitarist of the “Step Up Party” band.","\n","^I admired him and he was my inspiration. I dreamed of being like him.","\n","^Soon I will be having a debut live at a nearby community event.","\n","^That’s great!","\n","^Umm… yeah thanks.","\n","^He lowered his voice and avoided voice contact.","\n","^Seems like I found it, it is near the fountain located at the park entrance.","\n","^Hey maybe we can try to find it elsewhere.","\n","^Yeah… I guess we can try that, but…","\n","^Don’t worry about it, I would feel bad about not helping until the end. Let’s just try whatever possible.","\n","^Thanks… I really appreciate it.","\n",{"->":"progress3"},{"#f":1}],"progress3":["^Hey I’ve found it, it’s on the border of the fountain.","\n","^Really?! Oh, I think I did take it out again before leaving the park and there was an urgent matter.","\n","^Maybe that is when I forgot to put it back in my wallet and ran off.","\n","^Thank you very much!!","\n","^No problem. Now you can be more confident about the debut live.","\n","^…Yeah, I guess so.","\n","^Hmm you don’t seem really excited about it.","\n","^No, I am actually really excited about it… it’s just that…","\n","^If you don’t really want to talk about it, it’s fine.","\n","^…Since you’ve been a great help, you have the right to know about it. But it’s not really a happy story, are you willing to listen about it?","\n","^Yeah sure.","\n","^Actually, everyone knows that my father was a former band member of the Step Up Party band.","\n","^People are having high expectations for me as I am his son.","\n","^Recently I would feel really nervous when people mention about the event.","\n","^Maybe that’s the root source of the shadow energy, we might need to prevent it from growing further before it is powers up the shadow being.","\n","^What can we do?","\n","^Maybe you could try to identify what is causing him to feel anxious.","\n","^Most problems can’t be solved as people aren’t even aware what is causing it. That’s why identifying is the root cause of problem is important.","\n","^But how can I do that?","\n","^I will link your consciousness to his mind and maybe you can find some clues.","\n",{"->":"progress4"},{"#f":1}],"progress4":["^Hey, what about you try to play a song for me?","\n","^Eh…? But…","\n","^Even though I am not a musician but maybe I can give some advice from an audience standpoint.","\n","^So that you can feel more confident on the playing in front of others.","\n","^…I think I’ll try.","\n","^Let’s help him relax as he plays the music.","\n",{"->":"progress5"},{"#f":1}],"progress5":["^He slowly gains confident as he plays and attracted a small crowd.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}